app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`) VALUES ('MyString', 'MyString', '2016-06-18 15:36:28', '2016-06-18 15:36:28')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `name` = 'asdfasdf', `email` = 'asdf', `updated_at` = '2016-06-19 04:27:37' WHERE `users`.`id` = 3
---
  def update
    respond_to do |format|
      if @user.update(user_params)